{"https://dfs.ny.gov/reports_and_publications/press_releases/pr202109271": "['GOVERNOR HOCHUL AND MAYOR DE BLASIO ANNOUNCE $27 MILLION AVAILABLE TO PROVIDE HURRICANE IDA RELIEF TO UNDOCUMENTED NEW YORKERS '] ['Community Organizations Selected in Impacted Areas to Help Undocumented Survivors Receive Recovery Assistance', 'Selected Not-For-Profits Will Work Directly with Residents Who Do Not Qualify for FEMA Assistance', 'Program Will Open September 27 - Residents Should Call ONA Hotline at 1-800-566-7636 for Help on Where to Apply '] \"When I saw the devastation of Hurricane Ida, I pledged that we would do everything in our power to help impacted communities recover, and this funding is a fulfillment of that promise,\"  \"With these resources dedicated to undocumented New Yorkers who are ineligible for FEMA relief and partnerships with organizations on the ground, we can close gaps in aid and help New Yorkers in need. I urge eligible New Yorkers to apply to get the funding they need to rebuild.\"  \"We will ensure New Yorkers have access to the aid they need to recover from the devastating impacts of Hurricane Ida,\" Mayor Bill de Blasio said. \"Regardless of documentation status, we will get support to the most recent victims of our climate crisis and are here to help every step of the way.\" This program is being managed by the New York State Office for New Americans (ONA) and will target undocumented individuals located in the counties designated in the Presidential Major Disaster Declaration approved for Individual Assistance, which includes Bronx, Kings, Nassau, Queens, Richmond, Suffolk, Westchester and Rockland. A selected groups of not-for-profit organizations will provide information, assistance and help for residents who were impacted by the storm.\n\nToday's announcement bolsters the State and City commitment to support these not-for-profit organizations in a joint effort to distribute assistance. \n \nThe following organizations will provide assistance:\n·       , 402 East 152nd Street, Bronx, NY 10455 \n·       , 4101 8th Ave, 4th Floor, Brooklyn, NY 11232 \n·       , 133-29 41st Avenue, Suite 202, Flushing, NY 11355\n·       , 92-10 Roosevelt Ave, Jackson Heights, NY 11372 \n·       , 161 Port Richmond Ave, Staten Island, NY 10302\n·       , 134 Jackson Street, Hempstead, NY 11550\n·       , 1090 Suffolk Ave, Brentwood, NY 11717 \n·       , 27 Columbus Ave, Mount Kisco, NY 10549   \"The remnants of Hurricane Ida destroyed the homes and livelihoods of so many in its wake, particularly impacting immigrants throughout the city. Thanks to Governor Hochul's leadership, the New York State Office for New Americans is ready to employ our resources to help connect all undocumented New Yorkers with much needed relief to help them rebuild.\"\n \n \"Undocumented New Yorkers are a vital part of the fabric that makes our communities strong and have helped keep New York tough through this pandemic. I commend Governor Hochul for ensuring funding and relief is available to help all those impacted by Hurricane Ida. DFS staff joined the initial response effort and have seen firsthand that the funds distributed today will help to deliver critical financial relief that will ensure our affected communities heal as one.\"\n \n \"Many in our community lost everything after the devastating floods caused by Ida. In our office alone we have had to tell more than 25 families that there are no existing resources to help them in their time of need. The federal government needs to provide the same resources available to citizens to all who were impacted, including our neighbors who did not qualify due to immigration status. I am so thankful to Governor Hochul for the Ida Relief Fund for Excluded New Yorkers, a much needed humanitarian effort that will support my most vulnerable neighbors, who otherwise would be left with absolutely nothing.\"\n \nThe not-for-profit partner organizations will begin providing assistance and accepting applications on Monday, September 27, 2021. The application period will close on Friday November 26, 2021. In order to qualify for this program, the applicants must a) themselves not be eligible for FEMA assistance and b) not have an individual in their household who is eligible for assistance.\n \nTo get connected with assistance, impacted residents should call the ONA Hotline at (800) 566-7636 9:00am to 8:00pm, Monday through Friday or visit the partner not-for-profits starting September 27. Hotline assistance is available in over 200 languages.\n \nGovernor Hochul previously announced the launch of the new online resource hub for impacted New Yorkers, available at . The hub provides information on available assistance programs and where to find services such as shelter and access to food. Information on the site will be updated as more resources for New Yorkers become available.\n \n founded in 2012, is the nation's first statutorily created immigrant services office. ONA assists all new Americans with accessing and navigating a variety of free services and support through its statewide network of community-based providers. \"The aftermath of emergencies and disasters are difficult to manage by those directly or indirectly impacted, especially for those most vulnerable in our communities. Catholic Charities stands ready to support and assist those affected by Hurricane Ida and we thank Governor Hochul and New York State for the resources and commitment to do just that.\" \"It is critically important that people in storm-impacted areas get the assistance they need regardless of immigration status, housing situation or ability to pay for insurance. Many undocumented residents have served as essential workers and play a critical role in our economy, but have often been excluded from most forms of government relief. Neighbors Link is grateful to Governor Hochul for looking out for those who do not qualify for other financial relief and looks forward to administering the storm relief plan.\"\n \n \"The Chinese-American Planning Council is proud to partner with New York State to provide emergency relief to undocumented immigrants affected by Hurricane Ida. Many undocumented individuals and families do not qualify for FEMA assistance. We are glad this new resource will be made available to help them get back on their feet during this difficult time.\"\n \n \"The flooding from Ida devastated our communities, causing enormous damage to the homes of many of the most vulnerable New Yorkers. We applaud Governor Hochul for taking the step to provide critical relief for immigrants excluded from federal disaster assistance. Through this fund, neighbors and loved ones in dire need of relief will be able to begin repairing their homes and move forward with their lives.\"\n \n \"The Economic Opportunity Commission of Nassau County, Inc. has been at the forefront of helping low-income Nassau County individuals since its inception. Undocumented residents are particularly vulnerable to the impact of disasters and faced with challenges of not receiving storm recovery assistance, when they still must meet their basic needs of housing, and meet the health and safety needs for their family. This assistance is meant to equal the playing field for our most disenfranchised residents.\" \"The MinKwon Center for Community Action is proud to partner on this meaningful initiative to connect resources to undocumented immigrants impacted by hurricane Ida. Many undocumented immigrants in New York, often over-represented in rented basement dwellings, experienced substantial losses when the sewage and drainage systems were overrun by flashflood waters caused by Ida. With federal policy barring undocumented households including DREAMers from receiving direct FEMA disaster relief funds, we are thankful for Governor Hochul and Mayor de Blasio's announcement of this needed resource and showing that our neighbors, regardless of immigration status, should not be cruelly denied storm disaster or pandemic relief aid, but treated as the valuable human beings we all are.\"\n\nFor any immigrant in need of assistance, or to connect with ONA's programs, call the New Americans Hotline at 800-566-7636 9:00am to 8:00pm, Monday through Friday. All calls are confidential. Assistance is available in over 200 languages. For more information, visit  or follow ONA on Twitter at @NYSNewAmericans or Facebook at . ###  "}